app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save!
---
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "nathan"], ["password_digest", "$2a$10$NduNkzCdas5q36kzZV6HmeR.XE7KiBY5xXOxpI0ZJYLZKY0h8.S6e"], ["session_token", "QvOIEGVzUrMiHV1bekt-gw"]]